# Week11. Database

# Recap
## CREATE TABLE command
```sqlite
-- Comment
CREATE TABLE students ( -- inline comment
    student_id INTEGER NOT NULL PRIMARY KEY, -- student_id is unique
    last_name TEXT NOT NULL, -- NOT NULL request to set last_name during insert or updates
    first_name TEXT NOT NULL,
    username TEXT NOT NULL,
    exam1 REAL,
    exam2 REAL,
    exam3 REAL,
    UNIQUE (username) -- reinforce uniqueness of usernames and avoid duplicates entires
);
```
## DROP TABLE command
```sqlite
-- remove table
DROP TABLE students;
```
## INSERT command
```sqlite
INSERT INTO students ('student_id', 'first_name', 'last_name', 'username', 'exam1', 'exam2','exam3')
VALUES (101, 'John', 'Smith', 'johns', 90, 91, 92);

-- Unspecified field are set to NULL
INSERT INTO students ('student_id', 'first_name', 'last_name', 'username', 'exam1')
VALUES (102, 'Bob', 'Smith', 'bobs', 85);

-- In sqlite primary key is autoincremented
INSERT INTO students ('last_name', 'first_name', 'username', 'exam1')
VALUES ('Samanta', 'Smith', 'samantas', 95);

-- Insert multiple records
INSERT INTO students ('last_name', 'first_name', 'username', 'exam1', 'exam2','exam3')
VALUES
('Larson', 'Melissa', 'larsonmeli', 24, 89, 31),
('Novak', 'Melissa', 'novakmeli', 77, 3, 38),
('Sawyer', 'Wendy', 'sawyerwend', 81, 59, 30),
('Sawyer', 'Marcus', 'schultzmarc', 59, 29, 67)
```

| student_id | first_name | last_name | username    | exam1 | exam2 | exam3 |
|------------|------------|-----------|-------------|-------|-------|-------|
| 101        | Smith      | John      | johns       | 90.0  | 91.0  | 92.0  |
| 102        | Smith      | Bob       | bobs        | 85.0  | NULL  | NULL  |
| 103        | Samanta    | Smith     | samantas    | 95.0  | NULL  | NULL  |
| 104        | Larson     | Melissa   | larsonmeli  | 24.0  | 89.0  | 31.0  |
| 105        | Novak      | Melissa   | novakmeli   | 77.0  | 3.0   | 38.0  |
| 106        | Sawyer     | Wendy     | sawyerwend  | 81.0  | 59.0  | 30.0  |
| 107        | Sawyer     | Marcus    | schultzmarc | 59.0  | 29.0  | 67.0  |


## SELECT command

```sqlite
SELECT * FROM students;
SELECT username, exam1 FROM students;
SELECT username, exam1 FROM students ORDER BY username;
SELECT username, exam1 FROM students ORDER BY username LIMIT 20;
SELECT username, exam1, exam2 FROM students ORDER BY exam1 ASC LIMIT 10;
SELECT username, exam1 FROM students ORDER BY exam1 DESC LIMIT 10;
SELECT username, exam1, exam2 FROM students ORDER BY exam1 ASC LIMIT 10,20;

-- Calculating Average
SELECT avg(exam1) as `Exam1 Average`, avg(exam2), avg(exam3) FROM students;

-- Find all exam1 grades greater than 80
SELECT username, exam1 FROM students WHERE exam1 > 80;

-- Find all exam1 between
SELECT username, exam1 FROM students WHERE exam1 BETWEEN 80 and 90;

-- Get count of exam1 greater than 80
SELECT count(exam1) FROM students WHERE exam1 > 80;

-- Find students with same first name
SELECT * FROM students WHERE first_name == 'Melissa'

-- Find students IN list
SELECT * FROM students WHERE first_name in ('Melissa', 'Stephanie', 'Alex');

-- Find students LIKE %
SELECT * FROM students WHERE first_name LIKE 'Melis%';

-- Find students LIKE  %%
SELECT * FROM students WHERE first_name LIKE '%lis%';

-- Find Histogram exam1 grades using GROUP BY
SELECT exam1, count(exam1) as c  FROM students GROUP BY exam1 ORDER BY c DESC;

-- Group by
SELECT first_name, count(first_name), as name_count  FROM students
GROUP BY first_name ORDER BY name_count DESC;
```

# Week11. Relational Database (SQL)

## sqlite3 module

sqlite3 - python module to handle SQLite3 file databases.

In [89]:
import sqlite3

# open db file
conn = sqlite3.connect("students_py.db")
# get cursor
cur = conn.cursor()

In [90]:
# executing sql commands
# single command
cur.execute("DROP TABLE IF EXISTS students")
# get results
results = cur.fetchall()
print("output from DROP:", results)

# another single command
cur.execute("""
CREATE TABLE students ( -- inline comment
    student_id INTEGER NOT NULL PRIMARY KEY, -- student_id is unique
    last_name TEXT NOT NULL, -- NOT NULL request to set last_name during insert or updates
    first_name TEXT NOT NULL,
    username TEXT NOT NULL,
    exam1 REAL,
    exam2 REAL,
    exam3 REAL,
    UNIQUE (username) -- reinforce uniqueness of usernames and avoid duplicates entires
);
""")
# get results
results = cur.fetchall()
print("output from CREATE:", results)

output from DROP: []
output from CREATE: []

In [91]:
# another single command
cur.execute("""
    INSERT INTO students ('student_id', 'first_name', 'last_name', 'username', 'exam1', 'exam2','exam3')
    VALUES (101, 'John', 'Smith', 'johns', 90, 91, 92);""")
# get results
results = cur.fetchall()
print("output from INSERT:", results)

output from INSERT: []

In [92]:
# another single command
cur.execute("""
    INSERT INTO students ('student_id', 'first_name', 'last_name', 'username', 'exam1')
    VALUES (?,?,?,?,?)""", (102, 'Bob', 'Smith', 'bobs', 85))
cur.execute("""
    INSERT INTO students ('last_name', 'first_name', 'username', 'exam1')
    VALUES (?,?,?,?)""", ('Samanta', 'Smith', 'samantas', 95))

In [93]:
# executemany command - same command with different params
rows_to_insert = (
    ('Larson', 'Melissa', 'larsonmeli', 24, 89, 31),
    ('Novak', 'Melissa', 'novakmeli', 77, 3, 38),
    ('Sawyer', 'Wendy', 'sawyerwend', 81, 59, 30),
    ('Sawyer', 'Marcus', 'schultzmarc', 59, 29, 67))

cur.executemany("""
    INSERT INTO students ('last_name', 'first_name', 'username', 'exam1', 'exam2','exam3')
    VALUES (?,?,?,?,?,?);""", rows_to_insert)

In [94]:
cur.executescript("""
INSERT INTO students ('last_name', 'first_name', 'username', 'exam1', 'exam2', 'exam3')
VALUES ('Parsons','Cassie','parsonscass',61,62,65);

INSERT INTO students ('last_name', 'first_name', 'username', 'exam1', 'exam2', 'exam3')
VALUES ('Mcclain','Glenn','mcclainglen',85,98,52);

INSERT INTO students ('last_name', 'first_name', 'username', 'exam1', 'exam2', 'exam3')
VALUES ('Oliver','Janice','oliverjani',72,47,34);
""")

In [95]:
from pprint import pprint
cur.execute("SELECT * FROM students;")
results = cur.fetchall()
pprint(results)

[(101, 'Smith', 'John', 'johns', 90.0, 91.0, 92.0),
 (102, 'Smith', 'Bob', 'bobs', 85.0, None, None),
 (103, 'Samanta', 'Smith', 'samantas', 95.0, None, None),
 (104, 'Larson', 'Melissa', 'larsonmeli', 24.0, 89.0, 31.0),
 (105, 'Novak', 'Melissa', 'novakmeli', 77.0, 3.0, 38.0),
 (106, 'Sawyer', 'Wendy', 'sawyerwend', 81.0, 59.0, 30.0),
 (107, 'Sawyer', 'Marcus', 'schultzmarc', 59.0, 29.0, 67.0),
 (108, 'Parsons', 'Cassie', 'parsonscass', 61.0, 62.0, 65.0),
 (109, 'Mcclain', 'Glenn', 'mcclainglen', 85.0, 98.0, 52.0),
 (110, 'Oliver', 'Janice', 'oliverjani', 72.0, 47.0, 34.0)]

In [96]:
print(conn.row_factory)

None

In [106]:
# want a dict?
conn2 = sqlite3.connect("students_py.db")
def dict_factory(cursor, row):
    d = {}
    for idx, col in enumerate(cursor.description):
        d[col[0]] = row[idx]
    return d

conn2.row_factory = dict_factory

cur2 = conn2.cursor()
cur2.execute("SELECT * FROM students LIMIT ?,?", (1,2))
results = cur2.fetchall()
pprint(results)
conn2.close()

[{'exam1': 85.0,
  'exam2': None,
  'exam3': None,
  'first_name': 'Bob',
  'last_name': 'Smith',
  'student_id': 102,
  'username': 'bobs'},
 {'exam1': 95.0,
  'exam2': None,
  'exam3': None,
  'first_name': 'Smith',
  'last_name': 'Samanta',
  'student_id': 103,
  'username': 'samantas'}]

In [108]:
import pandas as pd
sql_statement = "SELECT username, exam1 FROM students WHERE exam1 BETWEEN 80 and 90;"
df = pd.read_sql_query(sql_statement, conn)
display(df)

      username  exam1
0        johns   90.0
1         bobs   85.0
2   sawyerwend   81.0
3  mcclainglen   85.0

In [109]:
between = (80, 90)

sql_statement = f"SELECT username, exam1 FROM students WHERE exam1 BETWEEN {between[0]} and {between[1]};"
df = pd.read_sql_query(sql_statement, conn)
display(df)

      username  exam1
0        johns   90.0
1         bobs   85.0
2   sawyerwend   81.0
3  mcclainglen   85.0

In [110]:
# prefered
sql_statement = f"SELECT username, exam1 FROM students WHERE exam1 BETWEEN ? and ?"
df = pd.read_sql_query(sql_statement, conn, params=between)
display(df)

      username  exam1
0        johns   90.0
1         bobs   85.0
2   sawyerwend   81.0
3  mcclainglen   85.0

In [111]:
cur.execute(sql_statement, between)
pprint(cur.fetchall())

[('johns', 90.0), ('bobs', 85.0), ('sawyerwend', 81.0), ('mcclainglen', 85.0)]

## Database Normalization

- Why use a database?
  - Ref: https://www.bbc.co.uk/bitesize/guides/z8yg87h/revision/4
  - Data is stored efficiently; saves space
  - Because data is stored efficiently, you can access it faster; easy to search
  - Because data is stored efficiently, you can easily update and remove data
  - Easily sort and group data
- What is database normalization?
  - Ref: https://www.complexsql.com/database-normalization/
  - Ref: http://www.databasedev.co.uk/1norm_form.html
  - The purpose of database normalization is to:
    - eliminate redundant data
    - reduce complexity of data, making it easier to manage the data and make change
    - ensure logical data dependencies
- How is database normalization achieved?
  - By fulfilling five normal forms. Each normal form represents an increasingly stringent set of rules. Usually fulfilling the first three normal forms is sufficient.
  - Ref: https://www.1keydata.com/database-normalization/first-normal-form-1nf.php


- First Normal Form  (1NF):
  1. if there are no repeating groups.
  2. all values are atomic, meaning they are the smallest meaningful value

- Second Normal Form  (2NF):
  1. the table is in first normal form
  2. each non-key field is functionally dependent on the entire primary key

- Third Normal Form (3NF):
  1. the table is in second normal form
  2. there are no transitive dependencies

- Ref: https://arctype.com/blog/2nf-3nf-normalization-example/

## SQL Examples
## Example1

In [6]:
import pandas as pd
import sqlite3
# open db file
conn = sqlite3.connect("example1.db")
# get cursor
cur = conn.cursor()
# execute single command
cur.execute("""
    CREATE TABLE [EMPLOYEES_PROJECTS_TIME] (
        [EmployeeID] TEXT  NOT NULL PRIMARY KEY,
        [Name] TEXT NOT NULL,
        [Project] TEXT NOT NULL,
        [Time] TEXT NOT NULL
    );""")
# execute several commands
cur.executescript("""
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-26', "Sean O'Brien", "30-452-T3, 30-457-T3, 32-244-T3", "0.25, 0.40, 0.30");
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-33', "Amy Guya", "30-452-T3, 30-382-TC, 32-244-T3", "0.05, 0.35, 0.60");
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-35', "Steven Baranco", "30-452-T3, 31-238-TC", "0.15, 0.80");
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-36', "Elizabeth Roslyn", "35-152-TC", "0.90");
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-38', "Carol Schaaf", "36-272-TC", "0.75");
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-40', "Alexandra Wing", "31-238-TC, 31-241-TC", "0.20, 0.70");
    """)

sql_statement = "select * FROM EMPLOYEES_PROJECTS_TIME;"
df = pd.read_sql_query(sql_statement, conn)
display(df)

,EmployeeID,Name,Project,Time
0,EN1-26,Sean O'Brien,"30-452-T3, 30-457-T3, 32-244-T3","0.25, 0.40, 0.30"
1,EN1-33,Amy Guya,"30-452-T3, 30-382-TC, 32-244-T3","0.05, 0.35, 0.60"
2,EN1-35,Steven Baranco,"30-452-T3, 31-238-TC","0.15, 0.80"
3,EN1-36,Elizabeth Roslyn,35-152-TC,0.90
4,EN1-38,Carol Schaaf,36-272-TC,0.75
5,EN1-40,Alexandra Wing,"31-238-TC, 31-241-TC","0.20, 0.70"

- Problems with example1
  - Repeating group of fields
  - The project and time fields are not made up of atomic values
  - Can't sort by last name
  - Can't sort by time because field is type text
  - Assumed relationship between project and time

## Example2

In [7]:
cur.executescript("""
    DROP TABLE IF EXISTS  EMPLOYEES_PROJECTS_TIME;
    CREATE TABLE [EMPLOYEES_PROJECTS_TIME] (
        [EmployeeID] TEXT  NOT NULL PRIMARY KEY,
        [Last_Name] TEXT NOT NULL,
        [First_Name] TEXT NOT NULL,
        [Project1] TEXT NULL,
        [Time1] REAL  NULL,
        [Project2] TEXT  NULL,
        [Time2] REAL NULL,
        [Project3] TEXT NULL,
        [Time3] REAL NULL
    );

    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-26', "O'Brien", "Sean", "30-452-T3", "0.25", "30-457-T3", "0.40", "32-244-T3", "0.30");
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-33', "Guya", "Amy", "30-452-T3", "0.05", "30-382-TC", "0.35", "32-244-T3", "0.60");
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-35', "Baranco", "Steven", "30-452-T3", "0.15", "31-238-TC", "0.80", NULL, NULL);
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-36', "Roslyn", "Elizabeth", "35-152-TC", "0.90", NULL, NULL, NULL, NULL);
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-38', "Schaaf", "Carol", "36-272-TC", "0.75", NULL, NULL, NULL, NULL);
    INSERT INTO EMPLOYEES_PROJECTS_TIME VALUES('EN1-40', "Wing", "Alexandra", "31-238-TC", "0.20", "31-241-TC",  "0.70", NULL, NULL);
    """)

sql_statement = "select * FROM EMPLOYEES_PROJECTS_TIME;"
df = pd.read_sql_query(sql_statement, conn)
display(df)

,EmployeeID,Last_Name,First_Name,Project1,Time1,Project2,Time2,Project3,Time3
0,EN1-26,O'Brien,Sean,30-452-T3,0.25,30-457-T3,0.40,32-244-T3,0.3
1,EN1-33,Guya,Amy,30-452-T3,0.05,30-382-TC,0.35,32-244-T3,0.6
2,EN1-35,Baranco,Steven,30-452-T3,0.15,31-238-TC,0.80,None,NaN
3,EN1-36,Roslyn,Elizabeth,35-152-TC,0.90,None,NaN,None,NaN
4,EN1-38,Schaaf,Carol,36-272-TC,0.75,None,NaN,None,NaN
5,EN1-40,Wing,Alexandra,31-238-TC,0.20,31-241-TC,0.70,None,NaN

- Analysis of example2
  - Can sort now!
  - How can you add another project?

## Example3

In [12]:
cur.executescript("""
    DROP TABLE IF EXISTS EMPLOYEES;
    DROP TABLE IF EXISTS PROJECTS_EMPLOYEES_TIME;
    CREATE TABLE [EMPLOYEES] (
        [EmployeeID] TEXT NOT NULL PRIMARY KEY,
        [Last_Name] TEXT NOT NULL,
        [First_Name] TEXT NOT NULL
    );


    INSERT INTO EMPLOYEES VALUES('EN1-26', "O'Brien", "Sean");
    INSERT INTO EMPLOYEES VALUES('EN1-33', "Guya", "Amy");
    INSERT INTO EMPLOYEES VALUES('EN1-35', "Baranco", "Steven");
    INSERT INTO EMPLOYEES VALUES('EN1-36', "Roslyn", "Elizabeth");
    INSERT INTO EMPLOYEES VALUES('EN1-38', "Schaaf", "Carol");
    INSERT INTO EMPLOYEES VALUES('EN1-40', "Wing", "Alexandra");


    CREATE TABLE [PROJECTS_EMPLOYEES_TIME] (
        [ProjectNum] TEXT  NOT NULL,
        [EmployeeID] TEXT NOT NULL,
        [Time] REAL NULL,
        PRIMARY KEY (ProjectNum, EmployeeID)
        FOREIGN KEY(EmployeeID) REFERENCES EMPLOYEES(EmployeeID)
    );

    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("30-328-TC", "EN1-33", "0.35");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("30-452-T3", "EN1-26", "0.25");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("30-452-T3", "EN1-33", "0.05");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("30-452-T3", "EN1-35", "0.15");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("31-238-TC", "EN1-35", "0.80");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("30-457-T3", "EN1-26", "0.40");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("31-238-TC", "EN1-40", "0.20");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("31-241-TC", "EN1-40", "0.70");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("32-244-T3", "EN1-33", "0.60");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("35-152-TC", "EN1-36", "0.90");
    INSERT INTO PROJECTS_EMPLOYEES_TIME VALUES("36-272-TC", "EN1-38", "0.75");
    """)
sql_statement = "select * FROM EMPLOYEES;"
df = pd.read_sql_query(sql_statement, conn)
print("Table: EMPLOYEES")
display(df)

sql_statement = "select * FROM PROJECTS_EMPLOYEES_TIME;"
print("Table: PROJECTS_EMPLOYEES_TIME")
df = pd.read_sql_query(sql_statement, conn)
display(df)

Table: EMPLOYEES

  EmployeeID Last_Name First_Name
0     EN1-26   O'Brien       Sean
1     EN1-33      Guya        Amy
2     EN1-35   Baranco     Steven
3     EN1-36    Roslyn  Elizabeth
4     EN1-38    Schaaf      Carol
5     EN1-40      Wing  Alexandra

Table: PROJECTS_EMPLOYEES_TIME

   ProjectNum EmployeeID  Time
0   30-328-TC     EN1-33  0.35
1   30-452-T3     EN1-26  0.25
2   30-452-T3     EN1-33  0.05
3   30-452-T3     EN1-35  0.15
4   31-238-TC     EN1-35  0.80
5   30-457-T3     EN1-26  0.40
6   31-238-TC     EN1-40  0.20
7   31-241-TC     EN1-40  0.70
8   32-244-T3     EN1-33  0.60
9   35-152-TC     EN1-36  0.90
10  36-272-TC     EN1-38  0.75

- Analysis of example3 -- **first normal form**
  - Can do groups by employeeid or projectnum
  - Can sort by time
  - Can sort by name

- First Normal Form  (1NF):
  1. if there are no repeating groups.
  2. all values are atomic, meaning they are the smallest meaningful value

## Example4
Need to add project title

In [13]:
cur.executescript("""
    DROP TABLE IF EXISTS EMPLOYEES_PROJECTS;
    CREATE TABLE [EMPLOYEES_PROJECTS] (
        [EmployeeID] TEXT  NOT NULL,
        [Last_Name] TEXT NOT NULL,
        [First_Name] TEXT NOT NULL,
        [ProjectNumber] TEXT NOT NULL,
        [ProjectTitle] TEXT NOT NULL,
        PRIMARY KEY (EmployeeID, ProjectNumber)
    );

    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-26", "O'Brien", "Sean", "30-452-T3", "STAR manual");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-26", "O'Brien", "Sean", "30-457-T3", "ISO procedures");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-26", "O'Brien", "Sean", "31-124-T3", "Employee handbook");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-33", "Guya", "Amy", "30-452-T3", "STAR manual");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-33", "Guya", "Amy", "30-482-TC", "Web Site");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-33", "Guya", "Amy", "31-241-TC", "New catalog");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-35", "Baranco", "Steven", "30-452-T3", "STAR manual");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-35", "Baranco", "Steven", "31-238-TC", "STAR prototype");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-36", "Roslyn", "Elizabeth", "35-152-TC", "STAR pricing");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-38", "Schaaf", "Carol", "36-272-TC", "Order system");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-40", "Wing", "Alexandra", "31-238-TC", "STAR prototype");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-40", "Wing", "Alexandra", "31-241-TC", "New catalog");
""")

sql_statement = "select * FROM EMPLOYEES_PROJECTS;"
df = pd.read_sql_query(sql_statement, conn)
display(df)

   EmployeeID Last_Name First_Name ProjectNumber       ProjectTitle
0      EN1-26   O'Brien       Sean     30-452-T3        STAR manual
1      EN1-26   O'Brien       Sean     30-457-T3     ISO procedures
2      EN1-26   O'Brien       Sean     31-124-T3  Employee handbook
3      EN1-33      Guya        Amy     30-452-T3        STAR manual
4      EN1-33      Guya        Amy     30-482-TC           Web Site
5      EN1-33      Guya        Amy     31-241-TC        New catalog
6      EN1-35   Baranco     Steven     30-452-T3        STAR manual
7      EN1-35   Baranco     Steven     31-238-TC     STAR prototype
8      EN1-36    Roslyn  Elizabeth     35-152-TC       STAR pricing
9      EN1-38    Schaaf      Carol     36-272-TC       Order system
10     EN1-40      Wing  Alexandra     31-238-TC     STAR prototype
11     EN1-40      Wing  Alexandra     31-241-TC        New catalog

- Analysis of example4
  - How would you update the project title for a given project? Have to edit in many places
  - Can you add a project without an employeeid?
  - How can you delete a project?

In [14]:
cur.executescript("""
    DROP TABLE IF EXISTS EMPLOYEES;
    DROP TABLE IF EXISTS PROJECTS;
    DROP TABLE IF EXISTS EMPLOYEES_PROJECTS;

    CREATE TABLE [EMPLOYEES] (
        [EmployeeID] TEXT  NOT NULL PRIMARY KEY,
        [Last_Name] TEXT NOT NULL,
        [First_Name] TEXT NOT NULL
    );

    INSERT INTO EMPLOYEES VALUES("EN1-26", "O'Brien", "Sean");
    INSERT INTO EMPLOYEES VALUES("EN1-33", "Guya", "Amy");
    INSERT INTO EMPLOYEES VALUES("EN1-35", "Baranco", "Steven");
    INSERT INTO EMPLOYEES VALUES("EN1-36", "Roslyn", "Elizabeth");
    INSERT INTO EMPLOYEES VALUES("EN1-38", "Schaaf", "Carol");
    INSERT INTO EMPLOYEES VALUES("EN1-40", "Wing", "Alexandra");


    CREATE TABLE [PROJECTS] (
        [ProjectNum] TEXT  NOT NULL,
        [ProjectTitle] TEXT NOT NULL
    );

    INSERT INTO PROJECTS VALUES("30-452-T3", "STAR manual");
    INSERT INTO PROJECTS VALUES("30-457-T3", "ISO procedures");
    INSERT INTO PROJECTS VALUES("30-482-TC", "Web site");
    INSERT INTO PROJECTS VALUES("31-124-T3", "Employee handbook");
    INSERT INTO PROJECTS VALUES("31-238-TC", "STAR prototype");
    INSERT INTO PROJECTS VALUES("31-238-TC2", "New catalog");
    INSERT INTO PROJECTS VALUES("35-152-TC", "STAR pricing");
    INSERT INTO PROJECTS VALUES("36-272-TC", "Order system");


    CREATE TABLE [EMPLOYEES_PROJECTS] (
        [EmployeeID] TEXT  NOT NULL,
        [ProjectNum] TEXT NOT NULL,
        PRIMARY KEY (EmployeeID, ProjectNum)
    );

    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-26", "30-452-T3");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-26", "30-457-T3");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-26", "31-124-T3");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-33", "30-328-TC");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-33", "30-452-T3");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-33", "32-244-T3");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-35", "30-452-T3");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-35", "31-238-TC");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-36", "35-152-TC");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-38", "36-272-TC");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-40", "31-238-TC2");
    INSERT INTO EMPLOYEES_PROJECTS VALUES("EN1-40", "31-241-TC");
    """)

sql_statement = "select * FROM EMPLOYEES;"
df = pd.read_sql_query(sql_statement, conn)
print("Table: EMPLOYEES")
display(df)

sql_statement = "select * FROM PROJECTS;"
print("Table: PROJECTS_EMPLOYEES_TIME")
df = pd.read_sql_query(sql_statement, conn)
display(df)

sql_statement = "select * FROM EMPLOYEES_PROJECTS;"
print("Table: PROJECTS_EMPLOYEES_TIME")
df = pd.read_sql_query(sql_statement, conn)
display(df)

Table: EMPLOYEES

  EmployeeID Last_Name First_Name
0     EN1-26   O'Brien       Sean
1     EN1-33      Guya        Amy
2     EN1-35   Baranco     Steven
3     EN1-36    Roslyn  Elizabeth
4     EN1-38    Schaaf      Carol
5     EN1-40      Wing  Alexandra

Table: PROJECTS_EMPLOYEES_TIME

   ProjectNum       ProjectTitle
0   30-452-T3        STAR manual
1   30-457-T3     ISO procedures
2   30-482-TC           Web site
3   31-124-T3  Employee handbook
4   31-238-TC     STAR prototype
5  31-238-TC2        New catalog
6   35-152-TC       STAR pricing
7   36-272-TC       Order system

Table: PROJECTS_EMPLOYEES_TIME

   EmployeeID  ProjectNum
0      EN1-26   30-452-T3
1      EN1-26   30-457-T3
2      EN1-26   31-124-T3
3      EN1-33   30-328-TC
4      EN1-33   30-452-T3
5      EN1-33   32-244-T3
6      EN1-35   30-452-T3
7      EN1-35   31-238-TC
8      EN1-36   35-152-TC
9      EN1-38   36-272-TC
10     EN1-40  31-238-TC2
11     EN1-40   31-241-TC

- Analysis of example5
  - **second normal form**

- Second Normal Form  (2NF):
  1. the table is in first normal form
  2. each non-key field is functionally dependent on the entire primary key

### Example6
Adding more field to project: project manager, project manager phone number

In [15]:
cur.executescript("""
DROP TABLE IF EXISTS PROJECTS;
CREATE TABLE [PROJECTS] (
    [ProjectNum] TEXT  NOT NULL PRIMARY KEY,
    [ProjectTitle] TEXT NOT NULL,
    [ProjectMgr] TEXT NOT NULL,
    [Phone] INTEGER NOT NULL
);

INSERT INTO PROJECTS VALUES("30-452-T3", "STAR manual", "Garrison", "2756");
INSERT INTO PROJECTS VALUES("30-457-T3", "ISO procedures", "Jacanda", "2954");
INSERT INTO PROJECTS VALUES("30-482-TC", "Web site", "Friedman", "2846");
INSERT INTO PROJECTS VALUES("31-124-T3", "Employee handbook", "Jones", "3102");
INSERT INTO PROJECTS VALUES("31-238-TC", "STAR prototype", "Garrison", "2756");
INSERT INTO PROJECTS VALUES("31-241-TC", "New catalog", "Jones", "3102");
INSERT INTO PROJECTS VALUES("35-152-TC", "STAR pricing", "Vance", "3022");
INSERT INTO PROJECTS VALUES("36-272-TC", "Order system", "Jacanda", "2954");
""")

sql_statement = "select * FROM PROJECTS;"
df = pd.read_sql_query(sql_statement, conn)
display(df)

  ProjectNum       ProjectTitle ProjectMgr  Phone
0  30-452-T3        STAR manual   Garrison   2756
1  30-457-T3     ISO procedures    Jacanda   2954
2  30-482-TC           Web site   Friedman   2846
3  31-124-T3  Employee handbook      Jones   3102
4  31-238-TC     STAR prototype   Garrison   2756
5  31-241-TC        New catalog      Jones   3102
6  35-152-TC       STAR pricing      Vance   3022
7  36-272-TC       Order system    Jacanda   2954

- Analysis of example 6
  - Phone number, which is a non-key field, has transitive dependency on another non-key field.

In [16]:
cur.executescript("""
DROP TABLE IF EXISTS MANAGERS;
DROP TABLE IF EXISTS PROJECTS;
CREATE TABLE [MANAGERS] (
    [ProjectMgr] TEXT NOT NULL PRIMARY KEY,
    [Phone] INTEGER NOT NULL
);

INSERT INTO MANAGERS VALUES("Friedman", "2846");
INSERT INTO MANAGERS VALUES("Garrison", "2756");
INSERT INTO MANAGERS VALUES("Jacanda", "2954");
INSERT INTO MANAGERS VALUES("Jones", "3102");
INSERT INTO MANAGERS VALUES("Vance", "3022");

CREATE TABLE [PROJECTS] (
    [ProjectNum] TEXT  NOT NULL PRIMARY KEY,
    [ProjectTitle] TEXT NOT NULL,
    [ProjectMgr] TEXT NOT NULL,
    FOREIGN KEY(ProjectMgr) REFERENCES MANAGERS(ProjectMgr)
);



INSERT INTO PROJECTS VALUES("30-452-T3", "STAR manual", "Garrison");
INSERT INTO PROJECTS VALUES("30-457-T3", "ISO procedures", "Jacanda");
INSERT INTO PROJECTS VALUES("30-482-TC", "Web site", "Friedman");
INSERT INTO PROJECTS VALUES("31-124-T3", "Employee handbook", "Jones");
INSERT INTO PROJECTS VALUES("31-238-TC", "STAR prototype", "Garrison");
INSERT INTO PROJECTS VALUES("31-241-TC", "New catalog", "Jones");
INSERT INTO PROJECTS VALUES("35-152-TC", "STAR pricing", "Vance");
INSERT INTO PROJECTS VALUES("36-272-TC", "Order system", "Jacanda");""")

sql_statement = "select * FROM MANAGERS;"
print("Table: MANAGERS")
df = pd.read_sql_query(sql_statement, conn)
display(df)

sql_statement = "select * FROM PROJECTS;"
print("Table: PROJECTS")
df = pd.read_sql_query(sql_statement, conn)
display(df)

Table: MANAGERS

  ProjectMgr  Phone
0   Friedman   2846
1   Garrison   2756
2    Jacanda   2954
3      Jones   3102
4      Vance   3022

Table: PROJECTS

  ProjectNum       ProjectTitle ProjectMgr
0  30-452-T3        STAR manual   Garrison
1  30-457-T3     ISO procedures    Jacanda
2  30-482-TC           Web site   Friedman
3  31-124-T3  Employee handbook      Jones
4  31-238-TC     STAR prototype   Garrison
5  31-241-TC        New catalog      Jones
6  35-152-TC       STAR pricing      Vance
7  36-272-TC       Order system    Jacanda

- Analysis of example7
  - Removed transitive dependency

- Third Normal Form (3NF):
  1. the table is in second normal form
  2. there are no transitive dependencies

## Foreign Key
- What is a foreign key? In a relational database, you can relate one table to another table. The two
tables can be related if and only if both tables have one column in common. This column has to be declared as a INTEGER data type that cannot
be NULL and has the `PRIMARY KEY` constraint -- example: ColumnName INTEGER NOT NULL PRIMARY KEY;
- IMPORTANT: Foreign key constraint is not enabled by default in SQLite

In [18]:
import pandas as pd
import sqlite3

def show_table(conn, table):
    """
    Helping function to displays whole table
    """
    print(f"Table: {table}")
    df = pd.read_sql_query(f"select * FROM {table};", conn)
    display(df)

def run_show_select(conn, select_statement):
    """
    Helping function to displays results of select statement
    """
    df = pd.read_sql_query(select_statement, conn)
    display(df)

In [16]:
conn = sqlite3.connect("teachers.db")
cur = conn.cursor()

cur.execute("""PRAGMA foreign_keys;""")
print(cur.fetchall())
cur.execute("""PRAGMA foreign_keys = ON;""")
cur.execute("""PRAGMA foreign_keys;""")
print(cur.fetchall())

[(0,)]
[(1,)]

In [39]:
cur.executescript("""
DROP TABLE IF EXISTS Courses;
DROP TABLE IF EXISTS Teachers;


CREATE TABLE Teachers (
   TeacherId INTEGER NOT NULL PRIMARY KEY,
   TeacherName  TEXT NOT NULL,
   TeacherEmployeeID INTEGER NOT NULL,
   UNIQUE (TeacherEmployeeID)
);

CREATE TABLE Courses(
  CourseId     INTEGER NOT NULL PRIMARY KEY,
  CourseName   TEXT NOT NULL,
  CourseShortID   TEXT NOT NULL,
  TeacherId INTEGER NULL,
  FOREIGN KEY(TeacherId) REFERENCES Teachers(TeacherId),
  UNIQUE (CourseName, CourseShortID)
);

INSERT INTO Teachers (TeacherName, TeacherEmployeeID)
VALUES ('Melissa Larson', 10001),
       ('Christopher Smith', 10002),
       ('Rohit Sharma', 10003);


INSERT INTO Courses (CourseName, CourseShortID, TeacherId)
VALUES ('Introduction to Python', 'EAS503', 1),
       ('Introduction to Probability', 'EAS501', 2),
       ('Introduction to Numerical Mathematics', 'EAS502', NULL),
       ('Statistical Learning', 'EAS595',1);

""")

show_table(conn, "Teachers")
show_table(conn, "Courses")

Table: Teachers

   TeacherId        TeacherName  TeacherEmployeeID
0          1     Melissa Larson              10001
1          2  Christopher Smith              10002
2          3       Rohit Sharma              10003

Table: Courses

   CourseId                             CourseName CourseShortID  TeacherId
0         1                 Introduction to Python        EAS503        1.0
1         2            Introduction to Probability        EAS501        2.0
2         3  Introduction to Numerical Mathematics        EAS502        NaN
3         4                   Statistical Learning        EAS595        1.0

## Joining

In [40]:
df = pd.read_sql_query("""
    SELECT t.TeacherName, c.CourseName, c.CourseShortID
    FROM Teachers as t
        INNER JOIN Courses as c
        ON t.TeacherId = c.TeacherId;
""", conn)
display(df)

         TeacherName                   CourseName CourseShortID
0     Melissa Larson       Introduction to Python        EAS503
1  Christopher Smith  Introduction to Probability        EAS501
2     Melissa Larson         Statistical Learning        EAS595

In [41]:
df = pd.read_sql_query("""
    SELECT t.TeacherName, c.CourseName, c.CourseShortID
    FROM Teachers as t
        LEFT JOIN Courses as c
        ON t.TeacherId = c.TeacherId;
""", conn)
display(df)

         TeacherName                   CourseName CourseShortID
0     Melissa Larson       Introduction to Python        EAS503
1     Melissa Larson         Statistical Learning        EAS595
2  Christopher Smith  Introduction to Probability        EAS501
3       Rohit Sharma                         None          None

- INNER JOIN - matches between left and right tables
- LEFT JOIN - for each record on left find record(s) on right or place NULL
- RIGHT and FULL OUTER JOINs are not currently supported

## Multiple Joining

In [45]:
cur.executescript("""
DROP TABLE IF EXISTS Cars;
DROP TABLE IF EXISTS Colors;
DROP TABLE IF EXISTS MakeModels;


CREATE TABLE Colors (
   color_id INTEGER NOT NULL PRIMARY KEY,
   color  TEXT NOT NULL,
   UNIQUE (color)
);

CREATE TABLE MakeModels (
  make_model_id     INTEGER NOT NULL PRIMARY KEY,
  Make   TEXT NOT NULL,
  Model   TEXT NOT NULL,
  Year INTEGER NOT NULL,
  UNIQUE (Make, Model)
);

CREATE TABLE Cars (
   car_id INTEGER NOT NULL PRIMARY KEY,
   make_model_id INTEGER NOT NULL,
   color_id INTEGER NOT NULL,
   available INTEGER NOT NULL,
   FOREIGN KEY(make_model_id) REFERENCES MakeModels(make_model_id),
   FOREIGN KEY(color_id) REFERENCES Colors(color_id)
);

INSERT INTO Colors (color) VALUES ('Red');
INSERT INTO Colors (color) VALUES ('Blue');
INSERT INTO Colors (color) VALUES ('Greeen');

INSERT INTO MakeModels (Make, Model, Year) VALUES ('Ford', 'Explorer', 2019);
INSERT INTO MakeModels (Make, Model, Year) VALUES ('Tayota', 'Camrey', 2020);
INSERT INTO MakeModels (Make, Model, Year) VALUES ('Honda', 'Accord', 2021);

INSERT INTO Cars (make_model_id, color_id, available) VALUES (1, 1, 1);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (2, 1, 1);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (3, 1, 1);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (1, 2, 0);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (1, 2, 0);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (3, 2, 0);
""")

show_table(conn, "Colors")
show_table(conn, "MakeModels")
show_table(conn, "Cars")

Table: Colors

   color_id   color
0         1     Red
1         2    Blue
2         3  Greeen

Table: MakeModels

   make_model_id    Make     Model  Year
0              1    Ford  Explorer  2019
1              2  Tayota    Camrey  2010
2              3   Honda    Accord  2015

Table: Cars

   car_id  make_model_id  color_id  available
0       1              1         1          1
1       2              2         1          1
2       3              3         1          1
3       4              1         2          0
4       5              1         2          0
5       6              3         2          0

In [46]:
# make it with text values
df = pd.read_sql_query("""
    SELECT *
    FROM Cars;
""", conn)
display(df)

   car_id  make_model_id  color_id  available
0       1              1         1          1
1       2              2         1          1
2       3              3         1          1
3       4              1         2          0
4       5              1         2          0
5       6              3         2          0

## Updating Values

In [47]:
cur.execute("""
    UPDATE Colors SET color = 'Green' WHERE color = "Greeen";""")

df = pd.read_sql_query("SELECT * FROM Colors;", conn)
display(df)

   color_id  color
0         1    Red
1         2   Blue
2         3  Green

In [48]:
cur.execute("""
    UPDATE MakeModels
    SET Make = 'Toyota'
    WHERE Make = "Tayota";
    """)

df = pd.read_sql_query("SELECT * FROM MakeModels;", conn)
display(df)

   make_model_id    Make     Model  Year
0              1    Ford  Explorer  2019
1              2  Toyota    Camrey  2010
2              3   Honda    Accord  2015

In [50]:
cur.execute("""
    UPDATE MakeModels
    SET Model = 'Camry'
    WHERE Model = "Camrey";""")

df = pd.read_sql_query("SELECT * FROM MakeModels;", conn)
display(df)

   make_model_id    Make     Model  Year
0              1    Ford  Explorer  2019
1              2  Toyota     Camry  2010
2              3   Honda    Accord  2015

In [51]:
df = pd.read_sql_query("""
    SELECT Cars.car_id, MakeModels.Make, MakeModels.Model, MakeModels.year, Colors.color, Cars.available
    FROM Cars
        INNER JOIN MakeModels ON MakeModels.make_model_id = Cars.make_model_id
        INNER JOIN Colors ON Colors.color_id = Cars.color_id;
""", conn)
display(df)

   car_id    Make     Model  Year color  available
0       1    Ford  Explorer  2019   Red          1
1       2  Toyota     Camry  2010   Red          1
2       3   Honda    Accord  2015   Red          1
3       4    Ford  Explorer  2019  Blue          0
4       5    Ford  Explorer  2019  Blue          0
5       6   Honda    Accord  2015  Blue          0

## Simple Delete

In [52]:
# delete
cur.execute("""
    DELETE FROM Cars
    WHERE available = 0;""")

df = pd.read_sql_query("""
    SELECT Cars.car_id, MakeModels.Make, MakeModels.Model, MakeModels.year, Colors.color, Cars.available
    FROM Cars
        INNER JOIN MakeModels ON MakeModels.make_model_id = Cars.make_model_id
        INNER JOIN Colors ON Colors.color_id = Cars.color_id;
""", conn)
display(df)

   car_id    Make     Model  Year color  available
0       1    Ford  Explorer  2019   Red          1
1       2  Toyota     Camry  2010   Red          1
2       3   Honda    Accord  2015   Red          1

## Delete from a linked table

In [53]:
# delete
cur.execute("""
    DELETE FROM Colors
    WHERE color = "Red";""")

IntegrityError: FOREIGN KEY constraint failed

In [54]:
df = pd.read_sql_query("""
    SELECT Cars.car_id, MakeModels.Make, MakeModels.Model, MakeModels.year, Colors.color, Cars.available
    FROM Cars
        INNER JOIN MakeModels ON MakeModels.make_model_id = Cars.make_model_id
        INNER JOIN Colors ON Colors.color_id = Cars.color_id;
""", conn)
display(df)

   car_id    Make     Model  Year color  available
0       1    Ford  Explorer  2019   Red          1
1       2  Toyota     Camry  2010   Red          1
2       3   Honda    Accord  2015   Red          1

In [57]:
cur.executescript("""
    DELETE FROM Cars
    WHERE car_id IN (1,2,3);

    DELETE FROM Colors
    WHERE color = "Red";
    """)

In [59]:
df = pd.read_sql_query("""
    SELECT Cars.car_id, MakeModels.Make, MakeModels.Model, MakeModels.year, Colors.color, Cars.available
    FROM Cars
        INNER JOIN MakeModels ON MakeModels.make_model_id = Cars.make_model_id
        INNER JOIN Colors ON Colors.color_id = Cars.color_id;
""", conn)
display(df)

Empty DataFrame
Columns: [car_id, Make, Model, Year, color, available]
Index: []

In [60]:
df = pd.read_sql_query("""
    SELECT *
    FROM Colors;
""", conn)
display(df)

   color_id  color
0         2   Blue
1         3  Green

## Delete from a linked table 2
what if we want on deleting color to delete all cars with that color.

In [62]:
cur.executescript("""
DROP TABLE IF EXISTS Cars;
DROP TABLE IF EXISTS Colors;
DROP TABLE IF EXISTS MakeModels;


CREATE TABLE Colors (
   color_id INTEGER NOT NULL PRIMARY KEY,
   color  TEXT NOT NULL,
   UNIQUE (color)
);

CREATE TABLE MakeModels (
  make_model_id     INTEGER NOT NULL PRIMARY KEY,
  Make   TEXT NOT NULL,
  Model   TEXT NOT NULL,
  Year INTEGER NOT NULL,
  UNIQUE (Make, Model)
);

CREATE TABLE Cars (
   car_id INTEGER NOT NULL PRIMARY KEY,
   make_model_id INTEGER NOT NULL,
   color_id INTEGER NOT NULL,
   available INTEGER NOT NULL,
   FOREIGN KEY(make_model_id) REFERENCES MakeModels(make_model_id),

   CONSTRAINT fk_color_id
     FOREIGN KEY (color_id)
     REFERENCES Colors(color_id)
     ON DELETE CASCADE
);

INSERT INTO Colors (color) VALUES ('Red');
INSERT INTO Colors (color) VALUES ('Blue');
INSERT INTO Colors (color) VALUES ('Green');

INSERT INTO MakeModels (Make, Model, Year) VALUES ('Ford', 'Explorer', 2019);
INSERT INTO MakeModels (Make, Model, Year) VALUES ('Toyota', 'Camry', 2020);
INSERT INTO MakeModels (Make, Model, Year) VALUES ('Honda', 'Accord', 2021);

INSERT INTO Cars (make_model_id, color_id, available) VALUES (1, 1, 1);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (2, 1, 1);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (3, 1, 1);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (1, 2, 0);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (1, 2, 0);
INSERT INTO Cars (make_model_id, color_id, available) VALUES (3, 2, 0);
""")

show_table(conn, "Colors")
show_table(conn, "MakeModels")
show_table(conn, "Cars")

Table: Colors

   color_id  color
0         1    Red
1         2   Blue
2         3  Green

Table: MakeModels

   make_model_id    Make     Model  Year
0              1    Ford  Explorer  2019
1              2  Toyota     Camry  2020
2              3   Honda    Accord  2021

Table: Cars

   car_id  make_model_id  color_id  available
0       1              1         1          1
1       2              2         1          1
2       3              3         1          1
3       4              1         2          0
4       5              1         2          0
5       6              3         2          0

In [63]:
# delete
cur.execute("""
    DELETE FROM Colors
    WHERE color = "Red";""")

In [64]:
show_table(conn, "Colors")
df = pd.read_sql_query("""
    SELECT Cars.car_id, MakeModels.Make, MakeModels.Model, MakeModels.year, Colors.color, Cars.available
    FROM Cars
        INNER JOIN MakeModels ON MakeModels.make_model_id = Cars.make_model_id
        INNER JOIN Colors ON Colors.color_id = Cars.color_id;
""", conn)
display(df)

Table: Colors

   color_id  color
0         2   Blue
1         3  Green

   car_id   Make     Model  Year color  available
0       4   Ford  Explorer  2019  Blue          0
1       5   Ford  Explorer  2019  Blue          0
2       6  Honda    Accord  2021  Blue          0